config.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Philippe Carphin)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h2 class="author">Philippe Carphin</h2><p class="date">Created: 2021-02-25 Thu 22:18</p>
</section>
<section id="table-of-contents"><div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-org32819fe">1. Minimalistic config</a></li>
<li><a href="#/slide-orgaf03d3d">2. Advanced</a></li>
<li><a href="#/slide-orgd779efb">3. New</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-org32819fe">
<h2 id="org32819fe"><span class="section-number-2">1</span> Minimalistic config</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
</section>
<section>
<section id="slide-org427a02d">
<h3 id="org427a02d"><span class="section-number-3">1.1</span> Intro</h3>
</section>
<section id="slide-org427a02d-split">
<p>
An elementary that can be taken as is to start from oriented towards leveragin
the full power of orgmode immediately.
</p>
<ul>
<li>Sane miscellaneous defaults</li>
<li>A built in color theme that looks good in orgmode exports</li>
<li>Evil mode if you know vim but not emacs</li>
<li>Basic helper frameworks that are defacto standard</li>
<li>Elementary org configuration allowing immediate use of built in package babel.</li>

</ul>

</section>
</section>
<section>
<section id="slide-org81b504a">
<h4 id="org81b504a"><span class="section-number-4">1.1.1</span> This config file</h4>
<p>
Emacs loads one file at startup from <code>~/.emacs</code>, <code>~/.emacs.d/init.el</code>.  The s
</p>
</section>
</section>
<section>
<section id="slide-org9ee6824">
<h3 id="org9ee6824"><span class="section-number-3">1.2</span> Package stuff</h3>
<p>
Standard stuff that is at the start of everyone's config file.
</p>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">require</span> '<span style="color: #008b8b;">package</span>)
(add-to-list 'package-archives '(<span style="color: #e67128;">"melpa"</span> . <span style="color: #e67128;">"http://melpa.org/packages/"</span>) t)
(add-to-list 'package-archives '(<span style="color: #e67128;">"org"</span>   . <span style="color: #e67128;">"http://orgmode.org/elpa/"</span>) t)
(add-to-list 'package-archives '(<span style="color: #e67128;">"gnu"</span>   . <span style="color: #e67128;">"http://elpa.gnu.org/packages/"</span>) t)
(package-initialize)
</code></pre>
</div>

<p>
Standard way for installing packages.  This replaces the use of <code>(require
a-package)</code> and adds convenience functions.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">unless</span> (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
(<span style="color: #ffad29; font-weight: bold;">eval-when-compile</span> (<span style="color: #ffad29; font-weight: bold;">require</span> '<span style="color: #008b8b;">use-package</span>))
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org1f53118">
<h3 id="org1f53118"><span class="section-number-3">1.3</span> Scrolling behavior</h3>
<ul>
<li><code>scroll-margin</code> Distance between cursor and top/bottom before scrolling starts.</li>
<li><code>scroll-step</code> makes the window move one line at a time.</li>

</ul>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> scroll-step 1)
(<span style="color: #ffad29; font-weight: bold;">setq-default</span> scroll-margin 10)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org89db4ee">
<h3 id="org89db4ee"><span class="section-number-3">1.4</span> Wrapping</h3>
<p>
Automattically hard-wrap text on 80 chars.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq-default</span> auto-fill-function 'do-auto-fill)
(<span style="color: #ffad29; font-weight: bold;">setq-default</span> fill-column 80)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgacad561">
<h3 id="orgacad561"><span class="section-number-3">1.5</span> Startup color theme</h3>
<p>
Dark theme that exports well
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(load-theme 'misterioso)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org9a72bc7">
<h3 id="org9a72bc7"><span class="section-number-3">1.6</span> Startup font</h3>
<p>
To change the font, as per this <a href="http://emacs.1067599.n8.nabble.com/Changing-font-size-of-all-the-buffers-including-the-status-line-and-the-characters-shown-in-electricr-tp466906p466932.html">Mailing list post</a>.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(custom-set-faces '(default ((t (<span style="color: #23d7d7;">:height</span> 200)))))
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orga4b3401">
<h3 id="orga4b3401"><span class="section-number-3">1.7</span> Helper frameworks</h3>
<div class="outline-text-3" id="text-1-7">
</div>
</section>
</section>
<section>
<section id="slide-org0988978">
<h4 id="org0988978"><span class="section-number-4">1.7.1</span> Undo tree</h4>
<p>
Use <code>C-x u</code> to get an undo tree buffer, really strong!
</p>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">undo-tree</span>
  <span style="color: #23d7d7;">:ensure</span> t
  <span style="color: #23d7d7;">:config</span> (global-undo-tree-mode))
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org25f833c">
<h4 id="org25f833c"><span class="section-number-4">1.7.2</span> Helm</h4>
<p>
Improve searching interface all over emacs.
</p>

<p>
Calling <code>helm-mode</code> remaps lots of emacs functions to their <code>helm</code>-ized
equivalents.
</p>

<p>
We also add a few ourselves.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">helm</span> <span style="color: #23d7d7;">:ensure</span> t
  <span style="color: #23d7d7;">:preface</span> (<span style="color: #ffad29; font-weight: bold;">require</span> '<span style="color: #008b8b;">helm-config</span>)
  <span style="color: #23d7d7;">:config</span> (helm-mode)
  <span style="color: #23d7d7;">:bind</span> ((<span style="color: #e67128;">"M-x"</span> . helm-M-x)
         (<span style="color: #e67128;">"C-x C-f"</span> . helm-find-files)
         (<span style="color: #e67128;">"C-x C-r"</span> . helm-recentf)
         (<span style="color: #e67128;">"C-x C-b"</span> . helm-buffers-list)
         (<span style="color: #e67128;">"C-c g"</span> . helm-grep-do-git-grep)))
</code></pre>
</div>

<ol class="org-ol">
<li><a id="orga77f783"></a>Remapped functions<br />
<p>
Notable remapped functions:
</p>
<ul>
<li><code>M-x</code> adds helm when writing function</li>
<li>Files and buffers
<ul>
<li><code>helm-recentf</code></li>
<li><code>helm-find-files</code></li>
<li><code>helm-buffer-list</code></li>

</ul></li>
<li><code>helm-mode</code>
<ul>
<li><code>describe-function</code></li>
<li><code>describe-symbol</code></li>

</ul></li>

</ul>
</li>

<li><a id="org4ef9e95"></a>Powerful tools<br />
<ul>
<li><code>helm-grep-do-git-grep</code></li>

</ul>
</li>
</ol>

</section>
</section>
<section>
<section id="slide-org08acb9a">
<h4 id="org08acb9a"><span class="section-number-4">1.7.3</span> Which-key</h4>
<p>
Help discovering available key sequences in all contexts.
</p>

<p>
Originally developped for spacemacs, now part of the standard emacs packages.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">which-key</span>
  <span style="color: #23d7d7;">:ensure</span> t
  <span style="color: #23d7d7;">:delight</span>
  <span style="color: #23d7d7;">:init</span>
  (<span style="color: #ffad29; font-weight: bold;">setq</span> which-key-separator <span style="color: #e67128;">" "</span>)
  (<span style="color: #ffad29; font-weight: bold;">setq</span> which-key-prefix-prefix <span style="color: #e67128;">"+"</span>)
  (<span style="color: #ffad29; font-weight: bold;">setq</span> which-key-idle-delay 0.01)
  <span style="color: #23d7d7;">:config</span>
  (which-key-mode))
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org496fa29">
<h4 id="org496fa29"><span class="section-number-4">1.7.4</span> Standard autocomplete</h4>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">company</span>
  <span style="color: #23d7d7;">:ensure</span> t
  <span style="color: #23d7d7;">:config</span> (global-company-mode)
          (<span style="color: #ffad29; font-weight: bold;">setq</span> company-idle-delay 0))
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org0d98df0">
<h3 id="org0d98df0"><span class="section-number-3">1.8</span> Org configuration</h3>
<div class="outline-text-3" id="text-1-8">
</div>
</section>
</section>
<section>
<section id="slide-orgfdc98ff">
<h4 id="orgfdc98ff"><span class="section-number-4">1.8.1</span> Looks</h4>
<div class="outline-text-4" id="text-1-8-1">
</div>
<ol class="org-ol">
<li><a id="org410385d"></a>Bullets<br />
<p>
Show nice bullets
</p>

<p>
Essential for easy tree viewing
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">org-bullets</span>
  <span style="color: #23d7d7;">:ensure</span> t
  <span style="color: #23d7d7;">:hook</span> (org-mode . org-bullets-mode))
</code></pre>
</div>
</li>
</ol>

</section>
</section>
