config.org
*** Exporting

- =ox-twbs= to export to beautiful HTML
- =ox-reveal= to export to Reveal.js presentation
- =ox-rst= to generate Restructured Text for sphinx documentation
- =htmlize= for colored code in all export formats

#+begin_src emacs-lisp
(use-package ox-rst :ensure t)
(use-package ox-twbs :ensure t)
(use-package ox-reveal :ensure t
  :config (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"))
(use-package htmlize :ensure t)
#+end_src

*** Babel
**** Babel Intro
Babel allows running of code blocks.  It is what enables this config to be in
orgmode format.

The ability to evaluate code in orgmode source blocks is built in with emacs but
must be activated to be used:

https://orgmode.org/worg/org-contrib/babel/languages/index.html#configure

**** Babel config
We simply add languages that we want to become available.  There are many more
but some of them require installing extra packages.

#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages
    '((shell . t)
      (python . t)))
#+end_src

**** Disable prompt
As a security precaution this is off by default.  It would indeed be quite
surprising if your text editor runs a shell command if you accidently do =C-c
C-c=.

But if you know it exists, then there is no big deal.  Indeed one is not
surprised that a command runs when the press enter in a shell.

#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src
    
** Evil mode
   :PROPERTIES:
   :header-args: :tangle yes
   :END:
*** Install and activate

#+begin_src emacs-lisp :results none
  (use-package evil
    :ensure t
    :init (setq evil-want-C-i-jump nil)
	  (setq evil-want-integration t)
	  (setq evil-want-C-u-scroll t)
    :config (evil-mode 1)
            (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
            (evil-global-set-key 'motion "j" 'evil-next-visual-line)
            (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
            (setq evil-default-state 'emacs)
            (setq evil-insert-state-modes nil)
            (setq evil-motion-state-modes nil)
            (setq evil-normal-state-modes '(fundamental-mode
                                            conf-mode
                                            prog-mode
                                            text-mode
                                            dired))
            (add-hook 'with-editor-mode-hook 'evil-insert-state))
#+end_src

The =evil-want-C-i-jump= is very important.  When running emacs in the shell,
the TAB key doesn't work properly.

Reference : [[https://www.youtube.com/watch?v=xaZMwNELaJY][Emacs From Scratch #3 : Keybindings and Evil]] et la config de Sam.

**** TODO Look into rune/evil-hook

*** Vim like window split keys

#+begin_src emacs-lisp
(define-key evil-insert-state-map (kbd "C-w") evil-window-map)
(define-key evil-insert-state-map (kbd "C-w /") 'split-window-right)
(define-key evil-insert-state-map (kbd "C-w -") 'split-window-below)
#+END_SRC

*** Map undo keys to undo-tree function

#+begin_src emacs-lisp
(define-key evil-normal-state-map (kbd "C-r") 'undo-tree-redo)
(define-key evil-normal-state-map (kbd "u") 'undo-tree-undo)
#+end_src


* Advanced

** Orgmode implementation of GTD
*** Agenda files
   :PROPERTIES:
   :header-args: :tangle no
   :END:

 To begin using org-agenda, all we need to do is to give it a directory that
 contains orgmode files.

 #+begin_src emacs-lisp
 (setq org-agenda-dir "~/NDocuments/gtd")
 (setq org-agenda-files (list org-agenda-dir))
 #+end_src

I don't know why I can't use org-agenda-dir here but if I put org-agenda-dir
where the string litteral is, it doesn't work.

It gives the message

#+begin_src text
Wrong type argument : stringp, org-agenda-dir.
#+end_src

*** GTD
    
   #+REVEAL: split
**** Keymap for GTD keybindings
      We define a keymap that will be accessed with =SPC a g=
 #+begin_src emacs-lisp
   (define-prefix-command 'gtd)
   (define-key evil-normal-state-map (kbd "SPC a g") 'gtd)
   (define-key gtd (kbd "a") 'org-agenda)
 #+end_src

   #+REVEAL: split

**** GTD files
***** Filename symbols
#+begin_src emacs-lisp :results none
(setq org-agenda-dir "~/NDocuments/gtd/")
(setq org-agenda-files '("~/NDocuments/gtd"))
(setq gtd-in-tray-file (concat org-agenda-dir "GTD_InTray.org")
    gtd-next-actions-file (concat org-agenda-dir "GTD_NextActions.org")
    gtd-project-list-file (concat org-agenda-dir "GTD_ProjectList.org")
    gtd-reference-file (concat org-agenda-dir "GTD_Reference.org")
    gtd-someday-maybe-file (concat org-agenda-dir "GTD_SomedayMaybe.org")
    gtd-tickler-file (concat org-agenda-dir "GTD_Tickler.org")
    gtd-journal-file (concat org-agenda-dir "GTD_Journal.org"))
#+end_src
