config.html
<section>
<section id="slide-orgc8ca6d2">
<h4 id="orgc8ca6d2"><span class="section-number-4">1.8.2</span> Exporting</h4>
<ul>
<li><code>ox-twbs</code> to export to beautiful HTML</li>
<li><code>ox-reveal</code> to export to Reveal.js presentation</li>
<li><code>ox-rst</code> to generate Restructured Text for sphinx documentation</li>
<li><code>htmlize</code> for colored code in all export formats</li>

</ul>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">ox-rst</span> <span style="color: #23d7d7;">:ensure</span> t)
(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">ox-twbs</span> <span style="color: #23d7d7;">:ensure</span> t)
(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">ox-reveal</span> <span style="color: #23d7d7;">:ensure</span> t
  <span style="color: #23d7d7;">:config</span> (<span style="color: #ffad29; font-weight: bold;">setq</span> org-reveal-root <span style="color: #e67128;">"https://cdn.jsdelivr.net/npm/reveal.js"</span>))
(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">htmlize</span> <span style="color: #23d7d7;">:ensure</span> t)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org79d748f">
<h4 id="org79d748f"><span class="section-number-4">1.8.3</span> Babel</h4>
<div class="outline-text-4" id="text-1-8-3">
</div>
<ol class="org-ol">
<li><a id="org0a4018c"></a>Babel Intro<br />
<p>
Babel allows running of code blocks.  It is what enables this config to be in
orgmode format.
</p>

<p>
The ability to evaluate code in orgmode source blocks is built in with emacs but
must be activated to be used:
</p>

<p>
<a href="https://orgmode.org/worg/org-contrib/babel/languages/index.html#configure">https://orgmode.org/worg/org-contrib/babel/languages/index.html#configure</a>
</p>
</li>

<li><a id="orgf901bc7"></a>Babel config<br />
<p>
We simply add languages that we want to become available.  There are many more
but some of them require installing extra packages.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(org-babel-do-load-languages 'org-babel-load-languages
    '((shell . t)
      (python . t)))
</code></pre>
</div>
</li>

<li><a id="org8efaf0c"></a>Disable prompt<br />
<p>
As a security precaution this is off by default.  It would indeed be quite
surprising if your text editor runs a shell command if you accidently do <code>C-c
C-c</code>.
</p>

<p>
But if you know it exists, then there is no big deal.  Indeed one is not
surprised that a command runs when the press enter in a shell.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-confirm-babel-evaluate nil)
</code></pre>
</div>
</li>
</ol>

</section>
</section>
<section>
<section id="slide-org17db5ca">
<h3 id="org17db5ca"><span class="section-number-3">1.9</span> Evil mode</h3>
<div class="outline-text-3" id="text-1-9">
</div>
</section>
</section>
<section>
<section id="slide-org9392afa">
<h4 id="org9392afa"><span class="section-number-4">1.9.1</span> Install and activate</h4>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">use-package</span> <span style="color: #008b8b;">evil</span>
  <span style="color: #23d7d7;">:ensure</span> t
  <span style="color: #23d7d7;">:init</span> (<span style="color: #ffad29; font-weight: bold;">setq</span> evil-want-C-i-jump nil)
        (<span style="color: #ffad29; font-weight: bold;">setq</span> evil-want-integration t)
        (<span style="color: #ffad29; font-weight: bold;">setq</span> evil-want-C-u-scroll t)
  <span style="color: #23d7d7;">:config</span> (evil-mode 1)
          (define-key evil-insert-state-map (kbd <span style="color: #e67128;">"C-g"</span>) 'evil-normal-state)
          (evil-global-set-key 'motion <span style="color: #e67128;">"j"</span> 'evil-next-visual-line)
          (evil-global-set-key 'motion <span style="color: #e67128;">"k"</span> 'evil-previous-visual-line)
          (<span style="color: #ffad29; font-weight: bold;">setq</span> evil-default-state 'emacs)
          (<span style="color: #ffad29; font-weight: bold;">setq</span> evil-insert-state-modes nil)
          (<span style="color: #ffad29; font-weight: bold;">setq</span> evil-motion-state-modes nil)
          (<span style="color: #ffad29; font-weight: bold;">setq</span> evil-normal-state-modes '(fundamental-mode
                                          conf-mode
                                          prog-mode
                                          text-mode
                                          dired))
          (add-hook 'with-editor-mode-hook 'evil-insert-state))
</code></pre>
</div>

<p>
The <code>evil-want-C-i-jump</code> is very important.  When running emacs in the shell,
the TAB key doesn't work properly.
</p>

<p>
Reference : <a href="https://www.youtube.com/watch?v=xaZMwNELaJY">Emacs From Scratch #3 : Keybindings and Evil</a> et la config de Sam.
</p>

<ol class="org-ol">
<li><a id="orgfc0f8de"></a><span class="todo TODO">TODO</span> Look into rune/evil-hook<br /></li>
</ol>

</section>
</section>
<section>
<section id="slide-orgb72fc45">
<h4 id="orgb72fc45"><span class="section-number-4">1.9.2</span> Vim like window split keys</h4>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(define-key evil-insert-state-map (kbd <span style="color: #e67128;">"C-w"</span>) evil-window-map)
(define-key evil-insert-state-map (kbd <span style="color: #e67128;">"C-w /"</span>) 'split-window-right)
(define-key evil-insert-state-map (kbd <span style="color: #e67128;">"C-w -"</span>) 'split-window-below)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd94a8f0">
<h4 id="orgd94a8f0"><span class="section-number-4">1.9.3</span> Map undo keys to undo-tree function</h4>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(define-key evil-normal-state-map (kbd <span style="color: #e67128;">"C-r"</span>) 'undo-tree-redo)
(define-key evil-normal-state-map (kbd <span style="color: #e67128;">"u"</span>) 'undo-tree-undo)
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-orgaf03d3d">
<h2 id="orgaf03d3d"><span class="section-number-2">2</span> Advanced</h2>
<div class="outline-text-2" id="text-2">
</div>
</section>
</section>
<section>
<section id="slide-org7d78439">
<h3 id="org7d78439"><span class="section-number-3">2.1</span> Orgmode implementation of GTD</h3>
<div class="outline-text-3" id="text-2-1">
</div>
</section>
</section>
<section>
<section id="slide-orgc07b371">
<h4 id="orgc07b371"><span class="section-number-4">2.1.1</span> Agenda files</h4>
<p>
To begin using org-agenda, all we need to do is to give it a directory that
contains orgmode files.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-agenda-dir <span style="color: #e67128;">"~/NDocuments/gtd"</span>)
(<span style="color: #ffad29; font-weight: bold;">setq</span> org-agenda-files '(<span style="color: #e67128;">"~/NDocuments/gtd"</span>))
</code></pre>
</div>

<p>
I don't know why I can't use org-agenda-dir here but if I put org-agenda-dir
where the string litteral is, it doesn't work.
</p>

<p>
It gives the message
</p>

<div class="org-src-container">

<pre  class="src src-text"><code trim>Wrong type argument : stringp, org-agenda-dir.
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgdaff258">
<h4 id="orgdaff258"><span class="section-number-4">2.1.2</span> GTD</h4>
</section>
<section id="slide-orgdaff258-split">
<ol class="org-ol">
<li><a id="org3f6198b"></a>Keymap for GTD keybindings<br />
<p>
We define a keymap that will be accessed with <code>SPC a g</code>
</p>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(define-prefix-command 'gtd)
(define-key evil-normal-state-map (kbd <span style="color: #e67128;">"SPC a g"</span>) 'gtd)
(define-key gtd (kbd <span style="color: #e67128;">"a"</span>) 'org-agenda)
</code></pre>
</div>

</section>
<section id="slide-org3f6198b-split">
</li>

<li><a id="org2ef7cc7"></a>GTD files<br />
<ol class="org-ol">
<li><a id="org00563dd"></a>Filename symbols<br />
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-agenda-dir <span style="color: #e67128;">"~/NDocuments/gtd/"</span>)
(<span style="color: #ffad29; font-weight: bold;">setq</span> org-agenda-files '(<span style="color: #e67128;">"~/NDocuments/gtd"</span>))
(<span style="color: #ffad29; font-weight: bold;">setq</span> gtd-in-tray-file (concat org-agenda-dir <span style="color: #e67128;">"GTD_InTray.org"</span>)
    gtd-next-actions-file (concat org-agenda-dir <span style="color: #e67128;">"GTD_NextActions.org"</span>)
    gtd-project-list-file (concat org-agenda-dir <span style="color: #e67128;">"GTD_ProjectList.org"</span>)
    gtd-reference-file (concat org-agenda-dir <span style="color: #e67128;">"GTD_Reference.org"</span>)
    gtd-someday-maybe-file (concat org-agenda-dir <span style="color: #e67128;">"GTD_SomedayMaybe.org"</span>)
    gtd-tickler-file (concat org-agenda-dir <span style="color: #e67128;">"GTD_Tickler.org"</span>)
    gtd-journal-file (concat org-agenda-dir <span style="color: #e67128;">"GTD_Journal.org"</span>))
</code></pre>
</div>
</li>
