config.org
***** Quick access to GTD files

  We use it to create bindings in the =gtd= map to open files

  #+begin_src emacs-lisp
    (defun gtd-open-in-tray      () (interactive) (find-file gtd-in-tray-file))
    (defun gtd-open-project-list () (interactive) (find-file gtd-project-list-file))
    (defun gtd-open-reference   () (interactive) (find-file gtd-reference-file))
    (defun gtd-open-next-actions () (interactive) (find-file gtd-next-actions-file))
    (define-key gtd (kbd "i") 'gtd-open-in-tray)
    (define-key gtd (kbd "p") 'gtd-open-project-list)
    (define-key gtd (kbd "r") 'gtd-open-reference)
    (define-key gtd (kbd "n") 'gtd-open-next-actions)
  #+end_src

    #+REVEAL: split
**** Todo keywords for GTD

 The first set of keywords is a generic set of keywords that I can give TODO
 keywords to items without having them be part of my GTD.

 The GTD-* keywords map to the various things that what David Allen calls "stuff"
 can be.

 #+begin_src emacs-lisp
 (setq org-todo-keywords '((sequence "TODO" "WAITING" "VERIFY" "|" "DONE")
			   (sequence 
                              "GTD-IN(i)"
                              "GTD-CLARIFY(c)"
			      "GTD-PROJECT(p)"
                              "GTD-SOMEDAY-MAYBE(s)"
			      "GTD-ACTION(a)"
                              "GTD-NEXT-ACTION(n)"
                              "GTD-WAITING(w)"
			      "|"
                              "GTD-REFERENCE(r)"
                              "GTD-DELEGATED(g)"
			      "GTD-DONE(d)")))
			   
 (setq org-todo-keyword-faces
    '(("GTD-IN" :foreground "#ff8800" :weight normal :underline t :size small)
      ("GTD-PROJECT" :foreground "#0088ff" :weight bold :underline t)
      ("GTD-ACTION" :foreground "#0088ff" :weight normal :underline nil)
      ("GTD-NEXT-ACTION" :foreground "#0088ff" :weight bold :underline nil)
      ("GTD-WAITING" :foreground "#aaaa00" :weight normal :underline nil)
      ("GTD-REFERENCE" :foreground "#00ff00" :weight normal :underline nil)
      ("GTD-SOMEDAY-MAYBE" :foreground "#7c7c74" :weight normal :underline nil)
      ("GTD-DONE" :foreground "#00ff00" :weight normal :underline nil)))
 #+end_src

   #+REVEAL: split
**** Definition of stuck projects

 In GTD projects are called "stuck" if they do not contain a =GTD-NEXT-ACTION=.
 This says that a stuck project is a headline where the todo keyword is
 =GTD-PROJECT= that do not contain a heading matching =GTD-NEXT-ACTION=.

 #+begin_src emacs-lisp
 (setq org-stuck-projects
       '("TODO=\"GTD-PROJECT\"" ;; Search query
         ("GTD-NEXT-ACTION")    ;; Not stuck if contains
         ()                     ;; Stuck if contains
         ""))                   ;; General regex
 #+end_src

 
**** Capturing
***** Capture templates
 #+begin_src emacs-lisp
 (setq org-capture-templates 
   '(("i" "GTD Input" entry (file+headline gtd-in-tray-file "GTD Input Tray")
      "* GTD-IN %?\n %i\n %a" :kill-buffer t)))
 #+end_src
***** Capture hotkey
 #+begin_src emacs-lisp
   (global-set-key (kbd "C-c c") 'org-capture)
 #+end_src

 #+RESULTS:
 : org-capture

*** Org Agenda
   #+REVEAL: split
    
**** Intro
 The agenda has features for working with tags and todo keywords.

 It provides ways of

 - Searching
 - Bulk editing
 - Creating views

 based on

 - TODO keywords
 - Tags
 - Dates (using the =DEADLINE= and =SCHEDULED= properties)
  
 I have adapted my use of the agenda to GTD but the methods here can serve as
 general examples nonetheless.
   #+REVEAL: split
    
**** Date interval for agenda view

 The default is kind of annoying.  It shows a week starting on a Sunday but what
 is annoying about that is that on Sunday, the agenda won't show what you have
 tomorrow!

 The way this is set, it will show 10 days starting 3 days in the past.

 #+begin_src emacs-lisp :results none
 (setq org-agenda-span 7
       org-agenda-start-on-weekday 0
       org-agenda-start-day "-2d")
 #+end_src

   #+REVEAL: split
    
**** Agenda Key
 I mapped a key because I like to pop in and out of it.

 #+begin_src emacs-lisp
 (global-set-key (kbd "C-c a") 'org-agenda)
 #+end_src

   #+REVEAL: split
    
**** Agenda custom commands

 #+begin_src emacs-lisp
 (setq org-agenda-custom-commands
       '(("c" "Simple agenda view"
           ((tags "PRIORITY=\"A\"")
            (stuck "" )
            (agenda "")
            (todo "GTD-ACTION")))
         ("g" . "GTD keyword searches searches")
         ("gi" todo "GTD-IN")
         ("gc" todo "GTD-CLARIFY")
         ("ga" todo "GTD-ACTION")
         ("gn" todo-tree "GTD-NEXT-ACTION")
         ("gp" todo "GTD-PROJECT")))
 #+end_src

*** Closing notes
#+begin_src emacs-lisp :results none
(setq org-log-done 'note)
#+end_src
