config.html
<li><a id="org9b3551d"></a>Quick access to GTD files<br />
<p>
We use it to create bindings in the <code>gtd</code> map to open files
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">gtd-open-in-tray</span>      () (<span style="color: #ffad29; font-weight: bold;">interactive</span>) (find-file gtd-in-tray-file))
(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">gtd-open-project-list</span> () (<span style="color: #ffad29; font-weight: bold;">interactive</span>) (find-file gtd-project-list-file))
(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">gtd-open-reference</span>   () (<span style="color: #ffad29; font-weight: bold;">interactive</span>) (find-file gtd-reference-file))
(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">gtd-open-next-actions</span> () (<span style="color: #ffad29; font-weight: bold;">interactive</span>) (find-file gtd-next-actions-file))
(define-key gtd (kbd <span style="color: #e67128;">"i"</span>) 'gtd-open-in-tray)
(define-key gtd (kbd <span style="color: #e67128;">"p"</span>) 'gtd-open-project-list)
(define-key gtd (kbd <span style="color: #e67128;">"r"</span>) 'gtd-open-reference)
(define-key gtd (kbd <span style="color: #e67128;">"n"</span>) 'gtd-open-next-actions)
</code></pre>
</div>

</section>
<section id="slide-org9b3551d-split">
</li>
</ol>
</li>
<li><a id="org0a7bddc"></a>Todo keywords for GTD<br />
<p>
The first set of keywords is a generic set of keywords that I can give TODO
keywords to items without having them be part of my GTD.
</p>

<p>
The GTD-* keywords map to the various things that what David Allen calls "stuff"
can be.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-todo-keywords '((sequence <span style="color: #e67128;">"TODO"</span> <span style="color: #e67128;">"WAITING"</span> <span style="color: #e67128;">"VERIFY"</span> <span style="color: #e67128;">"|"</span> <span style="color: #e67128;">"DONE"</span>)
                          (sequence 
                             <span style="color: #e67128;">"GTD-IN(i)"</span>
                             <span style="color: #e67128;">"GTD-CLARIFY(c)"</span>
                             <span style="color: #e67128;">"GTD-PROJECT(p)"</span>
                             <span style="color: #e67128;">"GTD-SOMEDAY-MAYBE(s)"</span>
                             <span style="color: #e67128;">"GTD-ACTION(a)"</span>
                             <span style="color: #e67128;">"GTD-NEXT-ACTION(n)"</span>
                             <span style="color: #e67128;">"GTD-WAITING(w)"</span>
                             <span style="color: #e67128;">"|"</span>
                             <span style="color: #e67128;">"GTD-REFERENCE(r)"</span>
                             <span style="color: #e67128;">"GTD-DELEGATED(g)"</span>
                             <span style="color: #e67128;">"GTD-DONE(d)"</span>)))

(<span style="color: #ffad29; font-weight: bold;">setq</span> org-todo-keyword-faces
   '((<span style="color: #e67128;">"GTD-IN"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#ff8800"</span> <span style="color: #23d7d7;">:weight</span> normal <span style="color: #23d7d7;">:underline</span> t <span style="color: #23d7d7;">:size</span> small)
     (<span style="color: #e67128;">"GTD-PROJECT"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#0088ff"</span> <span style="color: #23d7d7;">:weight</span> bold <span style="color: #23d7d7;">:underline</span> t)
     (<span style="color: #e67128;">"GTD-ACTION"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#0088ff"</span> <span style="color: #23d7d7;">:weight</span> normal <span style="color: #23d7d7;">:underline</span> nil)
     (<span style="color: #e67128;">"GTD-NEXT-ACTION"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#0088ff"</span> <span style="color: #23d7d7;">:weight</span> bold <span style="color: #23d7d7;">:underline</span> nil)
     (<span style="color: #e67128;">"GTD-WAITING"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#aaaa00"</span> <span style="color: #23d7d7;">:weight</span> normal <span style="color: #23d7d7;">:underline</span> nil)
     (<span style="color: #e67128;">"GTD-REFERENCE"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#00ff00"</span> <span style="color: #23d7d7;">:weight</span> normal <span style="color: #23d7d7;">:underline</span> nil)
     (<span style="color: #e67128;">"GTD-SOMEDAY-MAYBE"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#7c7c74"</span> <span style="color: #23d7d7;">:weight</span> normal <span style="color: #23d7d7;">:underline</span> nil)
     (<span style="color: #e67128;">"GTD-DONE"</span> <span style="color: #23d7d7;">:foreground</span> <span style="color: #e67128;">"#00ff00"</span> <span style="color: #23d7d7;">:weight</span> normal <span style="color: #23d7d7;">:underline</span> nil)))
</code></pre>
</div>

</section>
<section id="slide-org0a7bddc-split">
</li>
<li><a id="org859b259"></a>Definition of stuck projects<br />
<p>
In GTD projects are called "stuck" if they do not contain a <code>GTD-NEXT-ACTION</code>.
This says that a stuck project is a headline where the todo keyword is
<code>GTD-PROJECT</code> that do not contain a heading matching <code>GTD-NEXT-ACTION</code>.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-stuck-projects
      '(<span style="color: #e67128;">"TODO=\"GTD-PROJECT\""</span> <span style="color: #74af68;">;; </span><span style="color: #74af68;">Search query</span>
        (<span style="color: #e67128;">"GTD-NEXT-ACTION"</span>)    <span style="color: #74af68;">;; </span><span style="color: #74af68;">Not stuck if contains</span>
        ()                     <span style="color: #74af68;">;; </span><span style="color: #74af68;">Stuck if contains</span>
        <span style="color: #e67128;">""</span>))                   <span style="color: #74af68;">;; </span><span style="color: #74af68;">General regex</span>
</code></pre>
</div>
</li>


<li><a id="org90f02d0"></a>Capturing<br />
<ol class="org-ol">
<li><a id="orgf6309ef"></a>Capture templates<br />
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-capture-templates 
  '((<span style="color: #e67128;">"i"</span> <span style="color: #e67128;">"GTD Input"</span> entry (file+headline gtd-in-tray-file <span style="color: #e67128;">"GTD Input Tray"</span>)
     <span style="color: #e67128;">"* GTD-IN %?\n %i\n %a"</span> <span style="color: #23d7d7;">:kill-buffer</span> t)))
</code></pre>
</div>
</li>
<li><a id="org050d791"></a>Capture hotkey<br />
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(global-set-key (kbd <span style="color: #e67128;">"C-c c"</span>) 'org-capture)
</code></pre>
</div>
</li>
</ol>
</li>
</ol>

</section>
</section>
<section>
<section id="slide-org0150f71">
<h4 id="org0150f71"><span class="section-number-4">2.1.3</span> Org Agenda</h4>
</section>
<section id="slide-org0150f71-split">

<ol class="org-ol">
<li><a id="orgee8f3d0"></a>Intro<br />
<p>
The agenda has features for working with tags and todo keywords.
</p>

<p>
It provides ways of
</p>

<ul>
<li>Searching</li>
<li>Bulk editing</li>
<li>Creating views</li>

</ul>

<p>
based on
</p>

<ul>
<li>TODO keywords</li>
<li>Tags</li>
<li>Dates (using the <code>DEADLINE</code> and <code>SCHEDULED</code> properties)</li>

</ul>

<p>
I have adapted my use of the agenda to GTD but the methods here can serve as
general examples nonetheless.
</p>
</section>
<section id="slide-orgee8f3d0-split">
</li>

<li><a id="org4e1795b"></a>Date interval for agenda view<br />
<p>
The default is kind of annoying.  It shows a week starting on a Sunday but what
is annoying about that is that on Sunday, the agenda won't show what you have
tomorrow!
</p>

<p>
The way this is set, it will show 10 days starting 3 days in the past.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-agenda-span 10
      org-agenda-start-on-weekday nil
      org-agenda-start-day <span style="color: #e67128;">"-3d"</span>)
</code></pre>
</div>

</section>
<section id="slide-org4e1795b-split">
</li>

<li><a id="org9908d79"></a>Agenda Key<br />
<p>
I mapped a key because I like to pop in and out of it.
</p>

<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(global-set-key (kbd <span style="color: #e67128;">"C-c a"</span>) 'org-agenda)
</code></pre>
</div>

</section>
<section id="slide-org9908d79-split">
</li>

<li><a id="org67082cb"></a>Agenda custom commands<br />
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><code trim>(<span style="color: #ffad29; font-weight: bold;">setq</span> org-agenda-custom-commands
      '((<span style="color: #e67128;">"c"</span> <span style="color: #e67128;">"Simple agenda view"</span>
          ((tags <span style="color: #e67128;">"PRIORITY=\"A\""</span>)
           (stuck <span style="color: #e67128;">""</span> )
           (agenda <span style="color: #e67128;">""</span>)
           (todo <span style="color: #e67128;">"GTD-ACTION"</span>)))
        (<span style="color: #e67128;">"g"</span> . <span style="color: #e67128;">"GTD keyword searches searches"</span>)
        (<span style="color: #e67128;">"gi"</span> todo <span style="color: #e67128;">"GTD-IN"</span>)
        (<span style="color: #e67128;">"gc"</span> todo <span style="color: #e67128;">"GTD-CLARIFY"</span>)
        (<span style="color: #e67128;">"ga"</span> todo <span style="color: #e67128;">"GTD-ACTION"</span>)
        (<span style="color: #e67128;">"gn"</span> todo-tree <span style="color: #e67128;">"GTD-NEXT-ACTION"</span>)
        (<span style="color: #e67128;">"gp"</span> todo <span style="color: #e67128;">"GTD-PROJECT"</span>)))
</code></pre>
</div>
</li>
</ol>

</section>
</section>
